In [64]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', None],
    'Age': [25, np.nan, 30, None, 22],
    'City': ['Bangalore', None, 'Mumbai', 'Delhi', None],
    'Salary': [50000, 60000, None, 70000, 65000]
})

In [65]:
df.isnull()

    Name    Age   City  Salary
0  False  False  False   False
1  False   True   True   False
2  False  False  False    True
3  False   True  False   False
4   True  False   True   False

In [66]:
df.notnull()
df.isnull().sum()

Name      1
Age       2
City      2
Salary    1
dtype: int64

In [67]:
##df.dropna(axis=1,inplace=True)
df

      Name   Age       City   Salary
0    Alice  25.0  Bangalore  50000.0
1      Bob   NaN       None  60000.0
2  Charlie  30.0     Mumbai      NaN
3    David   NaN      Delhi  70000.0
4     None  22.0       None  65000.0

In [68]:
## df['Age'].fillna(df['Age'].mean())
df.fillna(method='bfill')

C:\Users\Mahesh khatri\AppData\Local\Temp\ipykernel_12284\908472037.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

      Name   Age       City   Salary
0    Alice  25.0  Bangalore  50000.0
1      Bob  30.0     Mumbai  60000.0
2  Charlie  30.0     Mumbai  70000.0
3    David  22.0      Delhi  70000.0
4     None  22.0       None  65000.0

In [69]:
df['City'].fillna("Unknown")

0    Bangalore
1      Unknown
2       Mumbai
3        Delhi
4      Unknown
Name: City, dtype: object

In [70]:
df.fillna(method='ffill')

C:\Users\Mahesh khatri\AppData\Local\Temp\ipykernel_12284\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

      Name   Age       City   Salary
0    Alice  25.0  Bangalore  50000.0
1      Bob  25.0  Bangalore  60000.0
2  Charlie  30.0     Mumbai  60000.0
3    David  30.0      Delhi  70000.0
4    David  22.0      Delhi  65000.0

In [71]:
df.fillna(method='bfill')

C:\Users\Mahesh khatri\AppData\Local\Temp\ipykernel_12284\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

      Name   Age       City   Salary
0    Alice  25.0  Bangalore  50000.0
1      Bob  30.0     Mumbai  60000.0
2  Charlie  30.0     Mumbai  70000.0
3    David  22.0      Delhi  70000.0
4     None  22.0       None  65000.0

In [72]:
df['Salary'].fillna(df['Age'].median())

0    50000.0
1    60000.0
2       25.0
3    70000.0
4    65000.0
Name: Salary, dtype: float64

In [73]:
df['Name'].fillna('Noname')

0      Alice
1        Bob
2    Charlie
3      David
4     Noname
Name: Name, dtype: object

In [84]:
df
st=df.isnull().sum()/len(df)*100
st

Name      20.0
Age       40.0
City      40.0
Salary    20.0
dtype: float64